{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Uterine clear-cell carcinoma",
  "figo_stage": "IA",
  "pathologic_stage": "pT1a pN0 pM0",
  "recommended_treatment": "Chemotherapy + vaginal brachytherapy ± EBRT",
  "description": "High-grade endometrial carcinoma with endometrioid and clear cell features invading only superficial myometrium. Complete surgical staging showed no lymph node or extrauterine metastasis.",
  "patient_notes": "Your pathology shows a uterine cancer that was confined to the inner muscle layer and removed completely with surgery. The cancer has features that may benefit from additional treatments such as chemotherapy, pelvic radiation, or internal radiation (brachytherapy). Your care team will discuss the best combination of these therapies to reduce the risk of recurrence. We are here to support you through each step of your treatment plan.",
  "verification": {
    "passed": false,
    "confidence": 0.82,
    "assessment": "FIGO and pathologic staging are accurate. The subtype should reflect high-risk clear-cell histology, and treatment should specify chemotherapy plus vaginal brachytherapy with EBRT considered per NCCN high-risk stage IA guidelines.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": false,
        "confidence": 0.85,
        "issues": "The report describes mixed endometrioid and clear cell histology; selecting only endometrioid underestimates high-risk clear-cell features."
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.8,
        "issues": "Recommendation is too generic and does not specify the combination of chemotherapy and vaginal brachytherapy required for high-risk clear-cell histology."
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "cancer_subtype",
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:24:16.595625",
    "change_explanations": {
      "cancer_subtype": "Changed from 'Endometrioid adenocarcinoma' to 'Uterine clear-cell carcinoma'. Reason: The report describes mixed endometrioid and clear cell histology; selecting only endometrioid underestimates high-risk clear-cell features.",
      "recommended_treatment": "Changed from 'Systemic therapy ± EBRT ± vaginal brachytherapy' to 'Chemotherapy + vaginal brachytherapy ± EBRT'. Reason: Recommendation is too generic and does not specify the combination of chemotherapy and vaginal brachytherapy required for high-risk clear-cell histology."
    }
  }
}