{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "Stage II",
  "pathologic_stage": "pT2 N0",
  "recommended_treatment": "Pelvic external beam radiation therapy with vaginal brachytherapy; consider adjuvant chemotherapy",
  "description": "Surgical pathology demonstrates endometrioid adenocarcinoma of the endometrium with deep myometrial invasion approaching the serosa and cervical stromal involvement, with no lymph node metastasis (0/12). Margins are uninvolved following hysterectomy with bilateral salpingo-oophorectomy and lymph node dissection.",
  "patient_notes": "Your reports show that the uterine cancer had grown into the muscle wall and into the cervix but did not spread to any lymph nodes. The hysterectomy and lymph node removal had clear margins and found no remaining cancer in the tissues. We will review these results and discuss whether you need any further treatment such as radiation to lower the risk of the cancer coming back.",
  "verification": {
    "passed": false,
    "confidence": 0.9,
    "assessment": "Pathologic and FIGO staging (Stage II, pT2N0) are accurate based on deep myometrial invasion, cervical stromal involvement, and negative nodes. Adjuvant therapy recommendations were missing and should follow NCCN guidelines for Stage II high-intermediate risk endometrioid carcinoma with EBRT, vaginal brachytherapy, and consideration of chemotherapy.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.99,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.99,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.99,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.8,
        "issues": "No NCCN-based adjuvant therapy recommendation provided for Stage II high-intermediate risk endometrioid carcinoma."
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:49:40.817922",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Not specified' to 'Pelvic external beam radiation therapy with vaginal brachytherapy; consider adjuvant chemotherapy'. Reason: No NCCN-based adjuvant therapy recommendation provided for Stage II high-intermediate risk endometrioid carcinoma."
    }
  }
}