{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "IIIC2",
  "pathologic_stage": "pT1a pN2 M0",
  "recommended_treatment": "Systemic therapy plus external beam pelvic radiotherapy and vaginal brachytherapy",
  "description": "High-grade endometrioid adenocarcinoma of the endometrium with 12 mm (46%) myometrial invasion and extensive lymphovascular invasion, involving multiple pelvic and para­aortic lymph nodes.",
  "patient_notes": "Your pathology shows a high-grade uterine cancer that has spread to lymph nodes. The cancer invaded less than half of the uterine muscle but metastasized to several lymph nodes. The recommended plan includes chemotherapy along with targeted radiation to the pelvis and possibly a small internal radiation treatment. Your care team will discuss this combined approach to help reduce the risk of recurrence.",
  "verification": {
    "passed": false,
    "confidence": 0.85,
    "assessment": "The staging (FIGO IIIC2; pT1a pN2 M0) is correct based on <50% myometrial invasion and para-aortic nodal metastases, but the treatment recommendation should reflect combined chemotherapy and radiation modalities as per NCCN guidelines for stage IIIC disease.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.6,
        "issues": "NCCN guidelines for stage IIIC2 endometrial cancer recommend combined systemic therapy with both external beam pelvic radiotherapy and vaginal brachytherapy, not optional modalities."
      },
      "description": {
        "correct": true,
        "confidence": 0.8,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.8,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:19:34.966020",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Systemic therapy ± EBRT ± vaginal brachytherapy' to 'Systemic therapy plus external beam pelvic radiotherapy and vaginal brachytherapy'. Reason: NCCN guidelines for stage IIIC2 endometrial cancer recommend combined systemic therapy with both external beam pelvic radiotherapy and vaginal brachytherapy, not optional modalities."
    }
  }
}