{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Mixed serous and clear cell carcinoma",
  "figo_stage": "FIGO Stage IIIA (microscopic extension to parametrium)",
  "final_pathologic_stage": "pT1a pN0 M0",
  "recommended_treatment": "Following NCCN guidelines for high‐risk histology Stage IA endometrial carcinoma: adjuvant platinum‐taxane chemotherapy (carboplatin + paclitaxel for 3–6 cycles) combined with vaginal brachytherapy (± consideration of pelvic external beam radiation).",
  "description": "High‐grade (FIGO grade III), predominantly serous endometrial carcinoma with <50% myometrial invasion, lymphovascular invasion, and a microscopic focus in the left parametrium; all sampled lymph nodes are negative. There is a minor clear cell component and no metastatic involvement of ovaries, tubes, peritoneum, or nodes. ",
  "patient_notes": "Your pathology report shows a high‐grade uterine cancer called serous carcinoma that was mostly confined to the upper layers of the uterine muscle with no cancer found in the lymph nodes. Because this type carries a higher risk of return even at an early stage, the recommended next step is chemotherapy (a combination of two drugs given through an IV) plus a targeted form of internal radiation (vaginal brachytherapy) to help reduce the chance of recurrence. Please discuss scheduling these treatments and any questions with your care team.",
  "verification": {
    "passed": false,
    "confidence": 0.75,
    "assessment": "The extraction captures the core findings and treatment rationale well but underestimates stage by omitting parametrial involvement and oversimplifies the histologic subtype. Staging fields should be revised to reflect extra-uterine spread.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.9,
        "issues": "The primary site is the uterus; classification as uterine cancer is appropriate."
      },
      "cancer_subtype": {
        "correct": false,
        "confidence": 0.8,
        "issues": "The report describes a predominantly serous carcinoma with a small clear-cell component. The extracted subtype omits the minor clear-cell component."
      },
      "figo_stage": {
        "correct": false,
        "confidence": 0.4,
        "issues": "The presence of a microscopic focus of metastatic carcinoma in the left parametrium represents extra-uterine spread and upstages beyond IA under FIGO 2009 criteria."
      },
      "pathologic_stage": {
        "correct": false,
        "confidence": 0.4,
        "issues": "Parametrial involvement should be reflected in the T category (e.g., pT3a), not pT1a."
      },
      "recommended_treatment": {
        "correct": true,
        "confidence": 0.8,
        "issues": "For high-risk histology confined to early uterine stages, platinum-taxane chemotherapy plus vaginal brachytherapy is consistent with NCCN guidance. If re-staged to IIIA, pelvic EBRT may also be indicated."
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": "Accurately summarizes grade, myometrial invasion, lymphovascular invasion, parametrial focus, nodal negativity, and minor clear-cell component. It omits some ancillary findings (e.g., intraepithelial carcinoma in polyps, adenomyosis involvement), but these are not critical to core staging summary."
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": "Clear, compassionate, and aligned with the extracted summary and treatment plan."
      }
    },
    "incorrect_fields": [
      "cancer_subtype",
      "figo_stage",
      "pathologic_stage"
    ]
  }
}