{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Uterine serous carcinoma",
  "figo_stage": "IIIB",
  "pathologic_stage": "pT3b pN0 pM0",
  "recommended_treatment": "Adjuvant chemotherapy (carboplatin-paclitaxel) combined with external beam radiation therapy and vaginal brachytherapy",
  "description": "High-grade uterine serous carcinoma with predominant papillary serous and clear cell components, <50% myometrial invasion, lymphovascular invasion, and microscopic metastasis to the left parametrium; lymph nodes and adnexa are negative.",
  "patient_notes": "The pathology shows a high-grade uterine cancer that has spread slightly outside the uterus but not to the lymph nodes. Additional treatment is recommended, including chemotherapy and radiation to the pelvic area. The chemotherapy regimen will likely include carboplatin and paclitaxel. Radiation therapy will target the pelvis to lower the chance of recurrence.",
  "verification": {
    "passed": false,
    "confidence": 0.9,
    "assessment": "The FIGO stage was incorrectly assigned as IIIA despite parametrial involvement indicating stage IIIB, and the TNM classification should be pT3b rather than pT3a. Treatment should include vaginal brachytherapy in addition to chemotherapy and EBRT for stage IIIB uterine serous carcinoma per NCCN guidelines.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "figo_stage": {
        "correct": false,
        "confidence": 0.95,
        "issues": "Parametrial involvement was misassigned as stage IIIA; FIGO IIIA is limited to serosal/adnexal involvement, whereas parametrial involvement is stage IIIB."
      },
      "pathologic_stage": {
        "correct": false,
        "confidence": 0.95,
        "issues": "T3a was assigned despite parametrium involvement, which defines T3b in TNM. Nodal and distant metastases are negative."
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.85,
        "issues": "Omitted vaginal brachytherapy, which is recommended along with EBRT and chemotherapy for stage IIIB high-grade serous carcinoma per NCCN."
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "figo_stage",
      "pathologic_stage",
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:40:39.208766",
    "change_explanations": {
      "figo_stage": "Changed from 'IIIA' to 'IIIB'. Reason: Parametrial involvement was misassigned as stage IIIA; FIGO IIIA is limited to serosal/adnexal involvement, whereas parametrial involvement is stage IIIB.",
      "pathologic_stage": "Changed from 'pT3a pN0 pM0' to 'pT3b pN0 pM0'. Reason: T3a was assigned despite parametrium involvement, which defines T3b in TNM. Nodal and distant metastases are negative.",
      "recommended_treatment": "Changed from 'Adjuvant chemotherapy (carboplatin-paclitaxel) and external beam radiation therapy' to 'Adjuvant chemotherapy (carboplatin-paclitaxel) combined with external beam radiation therapy and vaginal brachytherapy'. Reason: Omitted vaginal brachytherapy, which is recommended along with EBRT and chemotherapy for stage IIIB high-grade serous carcinoma per NCCN."
    }
  }
}