{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "IB",
  "pathologic_stage": "pT1b N0",
  "recommended_treatment": "Adjuvant vaginal brachytherapy combined with platinum-based chemotherapy",
  "description": "High-grade endometrioid adenocarcinoma of the endometrium measuring 3.5 x 3.3 x 1.6 cm with more than 50% myometrial invasion, focal lymphovascular invasion, negative cervical and parametrial margins, and no lymph node metastasis.",
  "patient_notes": "Your pathology shows a high-grade endometrial cancer that invaded deeply into the uterine wall (stage IB). To reduce the risk of recurrence, adjuvant vaginal brachytherapy combined with chemotherapy is recommended. Your doctors will discuss treatment details and next steps.",
  "verification": {
    "passed": false,
    "confidence": 0.85,
    "assessment": "FIGO and pathologic staging are accurate as stage IB (pT1b N0).",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 1.0,
        "issues": "Recommended treatment should align with NCCN guidelines for high-grade stage IB endometrioid adenocarcinoma"
      },
      "description": {
        "correct": true,
        "confidence": 0.8,
        "issues": ""
      },
      "patient_notes": {
        "correct": false,
        "confidence": 0.8,
        "issues": "Patient notes reflect lack of adjuvant recommendation, inconsistent with NCCN guidelines for stage IB"
      }
    },
    "incorrect_fields": [
      "recommended_treatment",
      "patient_notes"
    ],
    "timestamp": "2025-05-14T01:50:24.940208",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Not specified' to 'Adjuvant vaginal brachytherapy combined with platinum-based chemotherapy'. Reason: Recommended treatment should align with NCCN guidelines for high-grade stage IB endometrioid adenocarcinoma",
      "patient_notes": "Changed from 'The report shows a high-grade endometrial cancer that was fully removed and had invaded more than half of the uterine wall but did not spread to lymph nodes. It is classified as stage IB, meaning it was still confined to the uterus. Based on current guidelines, no specific adjuvant treatment recommendation is provided here. Your doctors will discuss any needed follow-up, which may include imaging or specialist consultations to monitor your recovery.' to 'Your pathology shows a high-grade endometrial cancer that invaded deeply into the uterine wall (stage IB). To reduce the risk of recurrence, adjuvant vaginal brachytherapy combined with chemotherapy is recommended. Your doctors will discuss treatment details and next steps.'. Reason: Patient notes reflect lack of adjuvant recommendation, inconsistent with NCCN guidelines for stage IB"
    }
  }
}