{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "IC",
  "pathologic_stage": "pT1c, pN0",
  "recommended_treatment": "Vaginal brachytherapy per NCCN guidelines for stage IC (pT1c) grade II endometrioid adenocarcinoma",
  "description": "Endometrioid adenocarcinoma of the uterus, grade II, with tumor invading greater than 50% of the myometrium and no lymph node metastasis (pT1c, pN0, FIGO stage IC).",
  "patient_notes": "Your report shows uterine endometrial cancer that invaded more than half of the muscle layer but did not spread to nearby lymph nodes or other organs. This is stage IC endometrioid adenocarcinoma. Your care team will review your results and discuss the most appropriate treatment plan based on current guidelines.",
  "verification": {
    "passed": false,
    "confidence": 0.9,
    "assessment": "Accurate staging identification but omission of recommended adjuvant therapy; NCCN guidelines recommend vaginal brachytherapy for intermediate-risk stage IC, grade II endometrioid carcinoma.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.9,
        "issues": "None"
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.9,
        "issues": "None"
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": "None"
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": "None"
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.9,
        "issues": "No adjuvant treatment recommendation provided despite intermediate-risk disease per NCCN guidelines."
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": "None"
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": "None"
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:34:06.726814",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Not specified' to 'Vaginal brachytherapy per NCCN guidelines for stage IC (pT1c) grade II endometrioid adenocarcinoma'. Reason: No adjuvant treatment recommendation provided despite intermediate-risk disease per NCCN guidelines."
    }
  }
}