{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Uterine serous carcinoma",
  "figo_stage": "IIB",
  "pathologic_stage": "pT2, pN0, pM0",
  "recommended_treatment": "Adjuvant chemotherapy with carboplatin and paclitaxel, plus consideration of vaginal brachytherapy and/or external beam radiation therapy; perform HER2 testing.",
  "description": "High-grade papillary serous carcinoma of the endometrium with less than half myometrial invasion and focal cervical stromal involvement. Surgical margins and all sampled lymph nodes are negative for metastatic disease.",
  "patient_notes": "Your pathology shows high-grade uterine serous carcinoma with cervical stromal involvement (FIGO stage IIB) and no lymph node spread. Due to high-risk features, adjuvant chemotherapy (carboplatin and paclitaxel) and radiation therapy are recommended to reduce recurrence risk.",
  "verification": {
    "passed": false,
    "confidence": 0.85,
    "assessment": "FIGO substaging to IIB is required for cervical stromal involvement; adjuvant therapy consistent with guidelines for high-grade uterine serous carcinoma was omitted.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "figo_stage": {
        "correct": false,
        "confidence": 0.9,
        "issues": "Generic FIGO Stage II given; report indicates stromal cervical involvement requiring substage IIB."
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.8,
        "issues": "No adjuvant therapy recommendations provided; NCCN guidelines for stage IIB uterine serous carcinoma require chemotherapy and consideration of radiotherapy and HER2 testing."
      },
      "description": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "patient_notes": {
        "correct": false,
        "confidence": 0.8,
        "issues": "Understates recurrence risk and omits recommendation for adjuvant therapy for high-grade uterine serous carcinoma."
      }
    },
    "incorrect_fields": [
      "figo_stage",
      "recommended_treatment",
      "patient_notes"
    ],
    "timestamp": "2025-05-14T01:48:59.874441",
    "change_explanations": {
      "figo_stage": "Changed from 'II' to 'IIB'. Reason: Generic FIGO Stage II given; report indicates stromal cervical involvement requiring substage IIB.",
      "recommended_treatment": "Changed from 'Not specified' to 'Adjuvant chemotherapy with carboplatin and paclitaxel, plus consideration of vaginal brachytherapy and/or external beam radiation therapy; perform HER2 testing.'. Reason: No adjuvant therapy recommendations provided; NCCN guidelines for stage IIB uterine serous carcinoma require chemotherapy and consideration of radiotherapy and HER2 testing.",
      "patient_notes": "Changed from 'Your surgery removed a high-grade uterine cancer that was confined to the uterus with no spread to lymph nodes. The pathology report shows a low risk of residual disease, but additional treatment may be recommended to reduce the chance of recurrence.' to 'Your pathology shows high-grade uterine serous carcinoma with cervical stromal involvement (FIGO stage IIB) and no lymph node spread. Due to high-risk features, adjuvant chemotherapy (carboplatin and paclitaxel) and radiation therapy are recommended to reduce recurrence risk.'. Reason: Understates recurrence risk and omits recommendation for adjuvant therapy for high-grade uterine serous carcinoma."
    }
  }
}