{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "Stage IB",
  "pathologic_stage": "pT1b pN0 M0",
  "recommended_treatment": "Adjuvant pelvic external beam radiation therapy with vaginal brachytherapy and systemic chemotherapy",
  "description": "The specimen reveals a Grade III endometrioid adenocarcinoma with >50% myometrial invasion, lymphovascular invasion, and no cervical or nodal metastases (pT1b pN0 M0). Surgical staging included total hysterectomy with unilateral salpingo-oophorectomy and comprehensive lymph node dissection, all negative for metastasis.",
  "patient_notes": "Your diagnosis is endometrial cancer that was removed by surgery and found to have invaded more than half of the uterine muscle but did not spread to lymph nodes. To lower the chance of return, we recommend targeted radiation to your pelvis and vagina and a course of chemotherapy. This combined approach is standard for your stage of disease and is aimed at improving long-term outcomes.",
  "verification": {
    "passed": true,
    "confidence": 0.9,
    "assessment": "The FIGO stage IB (pT1b pN0 M0) is accurately assigned based on >50% myometrial invasion, absence of cervical and nodal metastases. All findings and treatment recommendations align with NCCN guidelines for high-grade stage IB endometrioid adenocarcinoma with LVSI.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "description": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      }
    },
    "incorrect_fields": [],
    "timestamp": "2025-05-14T01:18:52.980629"
  }
}