{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Uterine serous carcinoma",
  "figo_stage": "IIIC2",
  "pathologic_stage": "pT2b N2 Mx",
  "recommended_treatment": "Total hysterectomy and bilateral salpingo-oophorectomy with surgical staging followed by carboplatin and paclitaxel chemotherapy plus external beam pelvic radiation and vaginal brachytherapy",
  "description": "Surgical pathology reveals uterine papillary serous adenocarcinoma measuring 4.5 cm with deep myometrial invasion, lymphovascular space invasion, cervical stromal involvement, and metastases in pelvic, common iliac, and para-aortic lymph nodes; omentum and ovaries are negative. Pathologic staging is pT2b N2 Mx, corresponding to FIGO stage IIIC2.",
  "patient_notes": "This report shows uterine serous carcinoma with spread to pelvic, common iliac, and para-aortic lymph nodes. Your uterus, ovaries, and fallopian tubes were removed, and no cancer was found in the ovaries or omentum. To lower the chance of recurrence, you will receive carboplatin and paclitaxel chemotherapy combined with external beam pelvic radiation and a vaginal brachytherapy boost. We will support you through each step of this treatment plan.",
  "verification": {
    "passed": false,
    "confidence": 0.95,
    "assessment": "Staging information is inaccurate; nodal metastases to para-aortic nodes requires FIGO IIIC2 and pN2 classification. Other fields are accurate.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "figo_stage": {
        "correct": false,
        "confidence": 0.9,
        "issues": "FIGO stage IIC is incorrect in the context of documented lymph node metastases; para-aortic involvement requires Stage IIIC2 according to FIGO staging for endometrial carcinoma."
      },
      "pathologic_stage": {
        "correct": false,
        "confidence": 0.9,
        "issues": "Pathologic stage pT2b N1 Mx misclassifies nodal status. Metastases in para-aortic nodes should be coded as N2, not N1."
      },
      "recommended_treatment": {
        "correct": true,
        "confidence": 0.8,
        "issues": ""
      },
      "description": {
        "correct": false,
        "confidence": 0.9,
        "issues": "Description repeats incorrect FIGO stage IIC and pT2b N1 Mx rather than the correct IIIC2 and pT2b N2 Mx."
      },
      "patient_notes": {
        "correct": false,
        "confidence": 0.9,
        "issues": "Patient notes mirror the wrong staging (IIC) and nodal classification (N1) instead of IIIC2 and N2, and lack mention of para-aortic involvement."
      }
    },
    "incorrect_fields": [
      "figo_stage",
      "pathologic_stage",
      "description",
      "patient_notes"
    ],
    "timestamp": "2025-05-14T01:17:38.822104",
    "change_explanations": {
      "figo_stage": "Changed from 'IIC' to 'IIIC2'. Reason: FIGO stage IIC is incorrect in the context of documented lymph node metastases; para-aortic involvement requires Stage IIIC2 according to FIGO staging for endometrial carcinoma.",
      "pathologic_stage": "Changed from 'pT2b N1 Mx' to 'pT2b N2 Mx'. Reason: Pathologic stage pT2b N1 Mx misclassifies nodal status. Metastases in para-aortic nodes should be coded as N2, not N1.",
      "description": "Changed from 'Surgical pathology reveals uterine papillary serous adenocarcinoma measuring 4.5 cm with deep myometrial invasion, lymphovascular space invasion, cervical stromal involvement, and metastases in pelvic, common iliac, and para-aortic lymph nodes; omentum and ovaries are negative. Pathologic staging is pT2b N1 Mx, corresponding to FIGO stage IIC.' to 'Surgical pathology reveals uterine papillary serous adenocarcinoma measuring 4.5 cm with deep myometrial invasion, lymphovascular space invasion, cervical stromal involvement, and metastases in pelvic, common iliac, and para-aortic lymph nodes; omentum and ovaries are negative. Pathologic staging is pT2b N2 Mx, corresponding to FIGO stage IIIC2.'. Reason: Description repeats incorrect FIGO stage IIC and pT2b N1 Mx rather than the correct IIIC2 and pT2b N2 Mx.",
      "patient_notes": "Changed from 'This report shows a type of uterine cancer called serous carcinoma that was found in the muscle of your uterus and cervix and has spread to nearby lymph nodes. Your uterus, ovaries, and fallopian tubes were removed, and no cancer was found in the ovaries or omentum. To lower the chance of the cancer coming back, you will receive chemotherapy with carboplatin and paclitaxel along with radiation to the pelvis and a vaginal boost. We will support you through each step of this treatment plan.' to 'This report shows uterine serous carcinoma with spread to pelvic, common iliac, and para-aortic lymph nodes. Your uterus, ovaries, and fallopian tubes were removed, and no cancer was found in the ovaries or omentum. To lower the chance of recurrence, you will receive carboplatin and paclitaxel chemotherapy combined with external beam pelvic radiation and a vaginal brachytherapy boost. We will support you through each step of this treatment plan.'. Reason: Patient notes mirror the wrong staging (IIC) and nodal classification (N1) instead of IIIC2 and N2, and lack mention of para-aortic involvement."
    }
  }
}