{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Uterine serous carcinoma",
  "figo_stage": "IIIC1",
  "pathologic_stage": "pT1b pN1 pM0",
  "recommended_treatment": "Adjuvant chemotherapy with carboplatin and paclitaxel combined with external beam radiation therapy (with or without vaginal brachytherapy) per NCCN guidelines for stage IIIC1 uterine serous carcinoma",
  "description": "High-grade uterine serous carcinoma with greater than 50% myometrial invasion and pelvic lymph node metastasis (pT1b, pN1).",
  "patient_notes": "This report shows a high-grade uterine cancer called serous carcinoma that has grown deep into the uterus and spread to a pelvic lymph node. Your medical team will discuss options like chemotherapy and radiation therapy to treat this diagnosis.",
  "verification": {
    "passed": false,
    "confidence": 0.95,
    "assessment": "The staging (FIGO IIIC1, pT1b pN1 pM0) is accurate and consistent with the pathology details, but the treatment field omitted the guideline-recommended adjuvant chemotherapy and radiation.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 1.0,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.9,
        "issues": "Missing specific NCCN guideline recommendations for stage IIIC1 uterine serous carcinoma"
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:45:03.660429",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Not specified' to 'Adjuvant chemotherapy with carboplatin and paclitaxel combined with external beam radiation therapy (with or without vaginal brachytherapy) per NCCN guidelines for stage IIIC1 uterine serous carcinoma'. Reason: Missing specific NCCN guideline recommendations for stage IIIC1 uterine serous carcinoma"
    }
  }
}