{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "Stage II",
  "pathologic_stage": "pT2 pN0",
  "recommended_treatment": "Total hysterectomy with bilateral salpingo-oophorectomy and pelvic lymph node assessment followed by adjuvant external beam pelvic radiation therapy with or without vaginal brachytherapy",
  "description": "Endometrioid adenocarcinoma, FIGO grade 2, involves the uterine corpus with superficial myometrial and endocervical stromal invasion without lymph node metastasis.",
  "patient_notes": "The pathology shows a moderately differentiated uterine cancer that has invaded only the superficial muscle layer and the area of the cervix but has not spread to lymph nodes. Surgery to remove the uterus and ovaries is planned, and further treatment will be decided based on final pathology results and clinical evaluation.",
  "verification": {
    "passed": false,
    "confidence": 0.9,
    "assessment": "FIGO Stage II and pathologic stage pT2 pN0 are accurately captured based on cervical stromal invasion without extrauterine spread; overall staging is consistent with NCCN guidelines for uterine endometrioid adenocarcinoma. Medical inference validation identified issues: Cancer subtype and staging are consistent, but treatment recommendations are missing; stage II endometrioid adenocarcinoma per NCCN requires adjuvant radiation therapy following surgery.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "description": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.85,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:46:55.436025",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Not specified' to 'Total hysterectomy with bilateral salpingo-oophorectomy and pelvic lymph node assessment followed by adjuvant external beam pelvic radiation therapy with or without vaginal brachytherapy'"
    }
  }
}