{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Endometrioid adenocarcinoma",
  "figo_stage": "Stage IA",
  "pathologic_stage": "pT1a pN0 pM0",
  "recommended_treatment": "Vaginal brachytherapy; observation may be considered",
  "description": "The patient has a grade 2 endometrioid adenocarcinoma of the uterus with 40% myometrial invasion, clear margins, and negative lymph nodes consistent with stage IA disease.",
  "patient_notes": "Your report shows an early-stage uterine cancer that invaded less than half of the uterine wall. No cancer was found in the lymph nodes or other tissues. To lower the risk of recurrence, you may be offered targeted internal vaginal radiation treatment. This approach aims to treat any residual cells while minimizing side effects.",
  "verification": {
    "passed": false,
    "confidence": 0.9,
    "assessment": "Stage IA, grade 2 endometrioid adenocarcinoma with <50% myometrial invasion and negative nodes is low risk; adjuvant vaginal brachytherapy is recommended per NCCN, not systemic therapy or EBRT.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.9,
        "issues": "The recommended treatment is too aggressive for Stage IA, grade 2 endometrioid adenocarcinoma without LVSI; systemic therapy and EBRT are not indicated per NCCN."
      },
      "description": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:32:00.255579",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Options include systemic therapy with or without external beam radiation therapy and with or without vaginal brachytherapy; or external beam radiation therapy with or without vaginal brachytherapy' to 'Vaginal brachytherapy; observation may be considered'. Reason: The recommended treatment is too aggressive for Stage IA, grade 2 endometrioid adenocarcinoma without LVSI; systemic therapy and EBRT are not indicated per NCCN."
    }
  }
}