{
  "cancer_organ_type": "Uterine cancer",
  "cancer_subtype": "Uterine serous carcinoma",
  "figo_stage": "IIIC2",
  "pathologic_stage": "pT3a N2",
  "recommended_treatment": "Carboplatin and paclitaxel chemotherapy with pelvic external beam radiation therapy and vaginal brachytherapy",
  "description": "High-grade uterine serous carcinoma measuring 3 cm with >50% myometrial invasion, extensive lymphovascular invasion, and metastatic involvement of pelvic and para-aortic lymph nodes (FIGO IIIC2, pT3a N2).",
  "patient_notes": "This report shows a high-grade serous cancer of the uterus that has invaded deep into the uterine muscle and spread to nearby lymph nodes (Stage IIIC2). The tumor measures 3 cm and there is evidence of lymphovascular invasion. Based on these findings, additional treatment such as chemotherapy and possibly radiation therapy will be recommended. Your care team will develop a personalized treatment plan and discuss the next steps with you.",
  "verification": {
    "passed": false,
    "confidence": 0.9,
    "assessment": "The extracted staging and pathology details are accurate. The only discrepancy is the omission of a guideline-based adjuvant treatment recommendation for FIGO IIIC2 uterine serous carcinoma.",
    "field_issues": {
      "cancer_organ_type": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "cancer_subtype": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "figo_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "pathologic_stage": {
        "correct": true,
        "confidence": 0.95,
        "issues": ""
      },
      "recommended_treatment": {
        "correct": false,
        "confidence": 0.9,
        "issues": "Field unspecified; NCCN guidelines specify adjuvant therapy for Stage IIIC2 uterine serous carcinoma."
      },
      "description": {
        "correct": true,
        "confidence": 0.9,
        "issues": ""
      },
      "patient_notes": {
        "correct": true,
        "confidence": 0.8,
        "issues": ""
      }
    },
    "incorrect_fields": [
      "recommended_treatment"
    ],
    "timestamp": "2025-05-14T01:37:49.234726",
    "change_explanations": {
      "recommended_treatment": "Changed from 'Not specified' to 'Carboplatin and paclitaxel chemotherapy with pelvic external beam radiation therapy and vaginal brachytherapy'. Reason: Field unspecified; NCCN guidelines specify adjuvant therapy for Stage IIIC2 uterine serous carcinoma."
    }
  }
}